{
  "_name_or_path": "Peltarion/dnabert-minilm-small",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "dim": 384,
  "dropout": 0.1,
  "eos_token_ids": 0,
  "finetuning_task": "dnaprom",
  "hidden_act": "gelu",
  "hidden_dim": 3072,
  "hidden_dropout_prob": 0.1,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "num_rnn_layer": 1,
  "output_attentions": true,
  "output_hidden_states": true,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "rnn": "lstm",
  "rnn_dropout": 0.0,
  "rnn_hidden": 768,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "split": 0,
  "torch_dtype": "float32",
  "transformers_version": "4.27.2",
  "type_vocab_size": 2,
  "vocab_size": 4101
}
